RIET/src/DataProcessors/TemporaryImpExpDesktop/TemporaryImpExpDesktop.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:DataProcessor>
  <name>TemporaryImpExpDesktop</name>
</mdclass:DataProcessor>

RIET/src/Enums/TypesOfTemporaryImpExpTransaction/TypesOfTemporaryImpExpTransaction.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>TypesOfTemporaryImpExpTransaction</name>
  <enumValues>
    <name>TemporaryImport</name>
  </enumValues>
  <enumValues>
    <name>TemporaryExport</name>
  </enumValues>
  <enumValues>
    <name>Prolongation</name>
  </enumValues>
  <enumValues>
    <name>ResponsibleChange</name>
  </enumValues>
  <enumValues>
    <name>Reexport</name>
  </enumValues>
  <enumValues>
    <name>Reimport</name>
  </enumValues>
  <enumValues>
    <name>PermanentImport</name>
  </enumValues>
  <enumValues>
    <name>PermanentExport</name>
  </enumValues>
</mdclass:Enum>

RIET/src/Documents/TemporaryImpExpTransactions/TemporaryImpExpTransactions.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>TemporaryImpExpTransactions</name>
  <registerRecords>InformationRegister.CustomsFilesOfGoods</registerRecords>
  <registerRecords>AccumulationRegister.QtyOfItemsInTemporaryImpExp</registerRecords>
  <registerRecords>InformationRegister.ExpiryDatesOfItemsInTemporaryImpExp</registerRecords>
  <registerRecords>InformationRegister.AdditionalDataOfItemsInTemporaryImpExp</registerRecords>
  <registerRecords>InformationRegister.ResponsiblesForItemsInTemporaryImpExp</registerRecords>
  <attributes>
    <name>ProcessLevel</name>
    <type>
      <types>CatalogRef.ProcessLevels</types>
    </type>
  </attributes>
  <attributes>
    <name>TypeOfTransaction</name>
    <type>
      <types>EnumRef.TypesOfTemporaryImpExpTransaction</types>
    </type>
  </attributes>
  <attributes>
    <name>CustomsFile</name>
    <type>
      <types>DocumentRef.CustomsFilesLight</types>
      <types>DocumentRef.ГТД</types>
    </type>
  </attributes>
  <attributes>
    <name>CustomsFileNo</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>28</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ExpiryDate</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>NewResponsible</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>CCAJobReference</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>15</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ShipperName</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>CustomsRegime</name>
    <type>
      <types>CatalogRef.CustomsRegimes</types>
    </type>
  </attributes>
  <attributes>
    <name>NewCustomsFileNo</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>28</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Comments</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>CreatedBy</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>CreationDate</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ModifiedBy</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>ModificationDate</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Items</name>
    <attributes>
      <name>Item</name>
      <type>
        <types>CatalogRef.СтрокиИнвойса</types>
      </type>
    </attributes>
    <attributes>
      <name>Qty</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>CustomsFileLineNo</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>3</precision>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

RIET/src/DataProcessors/TemporaryImpExpDesktop/Forms/Форма/Module.bsl
/////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ ФОРМЫ

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ОбщегоНазначенияКлиентСервер.ДобавитьЭлементКомпоновки(
		Список.Отбор,
		"QtyInTemporaryImpExp",
		ВидСравненияКомпоновкиДанных.Больше,
		0);
		
	ImportExportСервер.ДобавитьОтборПоProcessLevel(Параметры.Отбор);
		
	ResponsibleChange = Перечисления.TypesOfTemporaryImpExpTransaction.ResponsibleChange;	
		
КонецПроцедуры


/////////////////////////////////////////////////////////////////////////////////

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	Если ИмяСобытия = "ИзмененаTemporaryImportTransaction" 
		ИЛИ ИмяСобытия = "UpdateExpiryDateOfPayments" Тогда
		Элементы.Список.Обновить();
	КонецЕсли;
	
КонецПроцедуры


/////////////////////////////////////////////////////////////////////////////////
// КОМАНДЫ

&НаКлиенте
Процедура CreateTransactionWithSelectedItems(Команда)
	
	ТаблицаФормы = Элементы.Список;
	ВыделенныеСтроки = ТаблицаФормы.ВыделенныеСтроки;
	
	// Если не выделено ни одной строки - выходим
	Если ТаблицаФормы.ВыделенныеСтроки.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	// Проверим, что во всех строках совпадает Customs file no и во всех положительный Qty in temporary import
	ДанныеПервойВыделеннойСтроки = ТаблицаФормы.ДанныеСтроки(ВыделенныеСтроки[0]);	
	CustomsFile = ДанныеПервойВыделеннойСтроки.CustomsFile;
	CustomsFileNo = ДанныеПервойВыделеннойСтроки.CustomsFileNo;
	
	Для Каждого ВыделеннаяСтрока Из ВыделенныеСтроки Цикл
		
		ДанныеСтроки = ТаблицаФормы.ДанныеСтроки(ВыделеннаяСтрока);
		
		Если НЕ ЗначениеЗаполнено(ДанныеСтроки.QtyInTemporaryImpExp) Тогда
			
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(
				"Item """ + СокрЛП(ВыделеннаяСтрока) + """ is not in temporary import!");	
			Возврат;
			
		КонецЕсли;
		
		Если CustomsFile <> ДанныеСтроки.CustomsFile 
			ИЛИ CustomsFileNo <> ДанныеСтроки.CustomsFileNo Тогда
			
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(
				"Selected items are in different Customs files!");
			Возврат;
			
		КонецЕсли;
		
	КонецЦикла;
	
	// Сформируем параметры и откроем форму нового документа
	ЗначенияЗаполнения = Новый Структура;
	ЗначенияЗаполнения.Вставить("CustomsFile", CustomsFile);
	ЗначенияЗаполнения.Вставить("CustomsFileNo", CustomsFileNo);
	ЗначенияЗаполнения.Вставить("Items", ВыделенныеСтроки);
	
	СтруктураПараметров = Новый Структура;
	СтруктураПараметров.Вставить("ЗначенияЗаполнения", ЗначенияЗаполнения);
	ОткрытьФорму("Документ.TemporaryImpExpTransactions.ФормаОбъекта", СтруктураПараметров);
	
КонецПроцедуры


/////////////////////////////////////////////////////////////////////////////////

&НаКлиенте
Процедура ChangeResponsibleOfSelectedItems(Команда)
	
	ТаблицаФормы = Элементы.Список;
	ВыделенныеСтроки = ТаблицаФормы.ВыделенныеСтроки;
	
	// Если не выделено ни одной строки - выходим
	Если ТаблицаФормы.ВыделенныеСтроки.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	Для Каждого ВыделеннаяСтрока Из ВыделенныеСтроки Цикл
		
		ДанныеСтроки = ТаблицаФормы.ДанныеСтроки(ВыделеннаяСтрока);
		
		Если НЕ ЗначениеЗаполнено(ДанныеСтроки.QtyInTemporaryImpExp) Тогда
			
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(
				"Item """ + СокрЛП(ВыделеннаяСтрока) + """ is not in temporary import/export!");	
			Возврат;
			
		КонецЕсли;
		
	КонецЦикла;
	
	// Сформируем параметры и откроем форму нового документа
	ЗначенияЗаполнения = Новый Структура;
	ЗначенияЗаполнения.Вставить("TypeOfTransaction", ResponsibleChange);
	ЗначенияЗаполнения.Вставить("Items", ВыделенныеСтроки);
	
	СтруктураПараметров = Новый Структура;
	СтруктураПараметров.Вставить("ЗначенияЗаполнения", ЗначенияЗаполнения);
	ОткрытьФорму("Документ.TemporaryImpExpTransactions.ФормаОбъекта", СтруктураПараметров);
	
КонецПроцедуры


/////////////////////////////////////////////////////////////////////////////////

&НаКлиенте
Процедура ShowHistory(Команда)
	
	ТекущаяСтрока = Элементы.Список.ТекущаяСтрока;
	
	Если ТекущаяСтрока = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	СтруктураПараметров = Новый Структура("Item", ТекущаяСтрока);
	ОткрытьФорму("Обработка.TemporaryImpExpDesktop.Форма.History", СтруктураПараметров, ЭтаФорма, ТекущаяСтрока);
	
КонецПроцедуры

&НаКлиенте
Процедура UpdateExpiryDateOfPaymentsForSelectedItems(Команда)
	
	ТаблицаФормы = Элементы.Список;
	ВыделенныеСтроки = ТаблицаФормы.ВыделенныеСтроки;
	
	// Если не выделено ни одной строки - выходим
	Если ТаблицаФормы.ВыделенныеСтроки.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	Для Каждого ВыделеннаяСтрока Из ВыделенныеСтроки Цикл
		
		ДанныеСтроки = ТаблицаФормы.ДанныеСтроки(ВыделеннаяСтрока);
		
		Если НЕ ЗначениеЗаполнено(ДанныеСтроки.QtyInTemporaryImpExp) Тогда
			
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(
				"Item """ + СокрЛП(ВыделеннаяСтрока) + """ is not in temporary import/export!");	
			Возврат;
			
		КонецЕсли;
		
	КонецЦикла;
	
	// Сформируем параметры и откроем форму
	СтруктураПараметров = Новый Структура;
	СтруктураПараметров.Вставить("Items", ВыделенныеСтроки);
	ОткрытьФорму("Обработка.TemporaryImpExpDesktop.Форма.UpdateExpiryDateOfPayments", СтруктураПараметров);
	
КонецПроцедуры
